{
  "client_name": "Opaque",
  "url": "https://www.opaque.co/resources/articles/accenture-invests-in-opaque-to-advance-confidential-ai-and-data-solutions",
  "title": "Accenture Invests in OPAQUE to Advance Confidential AI and Data Solutions",
  "content": "ResourcesPress ReleaseAccenture Invests in OPAQUE to Advance Confidential AI and Data SolutionsByAccenture | OPAQUE2025-03-13•3 minutes ReadAccenture Invests in OPAQUE to Advance Confidential AI and Data SolutionsNEW YORK and SAN FRANCISCO; March 13, 2025 – Accenture (NYSE: ACN) has made a strategic investment inOPAQUE, a provider of a confidential AI platform that empowers organizations to run cloud-scale, general purpose AI workloads using encrypted data and governed data sharing, with a focus on privacy, sovereignty and compliance. This investment, made through Accenture Ventures, underscores Accenture’s commitment to accelerating AI adoption by helping enterprises securely unlock the full value of sensitive data.A recent survey by Accenture of 2,300 business leaders found that nearly all (97%) said they believe that generative AI is a “game-changing” technology worthy of long-term investment. However, 48% said their organizations lacked enough high-quality data to operationalize their generative AI initiatives.In addition to this investment, Accenture also intends to embed OPAQUE’s confidential AI platform into theAccenture AI Refineryand Accenture’s Trusted Data Services. This combined offering will help enterprises scale AI innovations with confidence, ensuring increased compliance and security without compromising data utility. OPAQUE’s technology removes common barriers to enterprise AI so that enterprises can use sensitive data without exposure risk and run AI workloads with full regulatory compliance and verifiable audit trails.“AI is only as good as the data it learns from, but privacy concerns have held businesses back from fully using more sensitive datasets,” said Teresa Tung, global lead of Data Capability, Accenture. “OPAQUE’s confidential AI platform helps businesses deploy AI agents that operate within confidential environments while maintaining data integrity and compliance. It’s about building trust with customers and unlocking a new era where AI can operate at scale, securely and responsibly.\"Working together, Accenture and OPAQUE will help enterprises use their most valuable and sensitive data for AI-driven insights, aiding the development of AI-powered customer intelligence, autonomous decision-making, and operational efficiency—all without sacrificing security. Enterprises can more rapidly deploy analytics, ML, and AI agents that can operate within confidential environments and execute complex workflows.“OPAQUE is unlocking the power of data that has been locked away for too long. Enterprises can finally move fast without breaking security,” said Aaron Fulkerson, CEO of OPAQUE. “As a leader in enterprise AI deployments, Accenture understands this better than anyone and is at the forefront of the charge to bring AI to enterprises safely and effectively.”“The future of AI will be built on privacy and trust, and our investment in OPAQUE is a pivotal move as we recognize the immense value in confidential AI platforms,” said Tom Lounibos, global lead, Accenture Ventures. \"OPAQUE’s technology aligns with our vision for responsible innovation. This investment and collaboration will boost our focus on bringing transformative solutions to market that allow businesses to harness the full power of data without compromising privacy.\"OPAQUE will also join Accenture Ventures’ Project Spotlight, a vertical accelerator for data and AI companies. Project Spotlight offers extensive access to Accenture’s domain expertise and its enterprise clients, helping startups harness creativity and deliver on the promise of their technology.Terms of the investment were not disclosed.About AccentureAccenture is a leading global professional services company that helps the world’s leading businesses, governments and other organizations build their digital core, optimize their operations, accelerate revenue growth and enhance citizen services—creating tangible value at speed and scale. We are a talent- and innovation-led company with 799,000 people serving clients in more than 120 countries. Technology is at the core of change today, and we are one of the world’s leaders in helping drive that change, with strong ecosystem relationships. We combine our strength in technology and leadership in cloud, data and AI with unmatched industry experience, functional expertise and global delivery capability. Our broad range of services, solutions and assets across Strategy & Consulting,Technology, Operations, Industry X and Song, together with our culture of shared success and commitment to creating 360° value, enable us to help our clients reinvent and build trusted, lasting relationships. We measure our success by the 360° value we create for our clients, each other, our shareholders, partners and communities. Visit us at accenture.com.About OPAQUEOPAQUE is a confidential AI platform developed by world-renowned researchers at the Berkeley RISELab. The platform empowers organizations to run cloud-scale, general-purpose AI wor",
  "short_description": "Accenture invests in confidential AI",
  "actionable": true,
  "opportunity_type": "New business opportunity",
  "suggested_action": "Explore partnership with OPAQUE",
  "relevance": "Leverage confidential AI for client solutions.",
  "read": false,
  "scraped_at": "2025-06-30T09:10:39.992025"
}